"""
    https://leetcode.cn/circle/discuss/CaOJ45/

    1、集合的子交并补
        A ∩ B = a & b
        A ∪ B = a | b
        A \ B = a & ∼b
        A ⊆ B = a & b = a 且 a | b = b

    2、元素和集合
         假设我们需要处理的元素是 i  目标集合是s
        全集    (1 << n) - 1
        补集   ((1 << n) - 1) ^ s
        i ∈ S  (s << i) & 1 = 1
        i ∈ S  (s << 1) & 1 = 0
        添加元素i到集合中  s | (1 << i)
        删除元素  s & ~ (1 << i)
        删除最小元素 s & (s - 1)
        统计二进制1的个数 bin(s).count('1')
        常见二进制 16进制表示
            1、偶数位全是1  (0b10101010101010101010) = (0xaaaaa)
            1、奇数位全是1  (0b1010101010101010101) = (0x55555)
"""

s = [1, 2, 4, 6]

t = 0
for i in s:
    t |= (1 << i)

a = 0x1010101

print(bin(14)[2:])
print(bin(13)[2:])
